#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.production_env.module.mailu-vm.openstack_networking_secgroup_v2.main-sg: Refreshing state... [id=ca23c054-f7fd-434e-ae5e-529242766ba3]
module.production_env.module.nc-office-vm.openstack_networking_secgroup_v2.main-sg: Refreshing state... [id=4d84c1c5-484b-45a1-a23f-b32d367f41b4]
module.prod_db.random_password.osem_db_master_pass: Refreshing state... [id=none]
module.production_env.aws_ses_domain_identity.main: Refreshing state... [id=seagl.org]
data.aws_vpc.vpc: Reading...
module.prod_db.aws_secretsmanager_secret.osem-db-pass: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:663166083306:secret:db-pass-osem-5KW1mS]
aws_s3_bucket.state: Refreshing state... [id=seagl-terraform]
module.prod_db.aws_db_subnet_group.osem: Refreshing state... [id=osem]
module.production_env.aws_route53_zone.apex: Refreshing state... [id=Z0173878287JIU5M4KB8R]
aws_instance.dokku: Refreshing state... [id=i-02ee81d4bd0860d30]
module.production_env.aws_route53_record.mailu-test-a: Refreshing state... [id=Z0173878287JIU5M4KB8R_mail.mail-test.seagl.org_A]
module.production_env.aws_route53_record.mailu-test-spf: Refreshing state... [id=Z0173878287JIU5M4KB8R_mail-test.seagl.org_TXT]
module.production_env.aws_route53_record.mailu-test-autoconfig-cname: Refreshing state... [id=Z0173878287JIU5M4KB8R_autoconfig.mail-test.seagl.org_CNAME]
module.production_env.aws_route53_record.route_53_root_txt: Refreshing state... [id=Z0173878287JIU5M4KB8R__TXT]
module.production_env.aws_route53_record.mailu-test-mx: Refreshing state... [id=Z0173878287JIU5M4KB8R_mail-test.seagl.org_MX]
module.production_env.aws_route53_record.route_53_dmarc_txt: Refreshing state... [id=Z0173878287JIU5M4KB8R__dmarc.seagl.org_TXT]
module.production_env.aws_route53_record.dokku_wildcard: Refreshing state... [id=Z0173878287JIU5M4KB8R_*.seagl.org_CNAME]
module.production_env.aws_route53_record.mailu-test-autoconfig-srv["_pop3s._tcp"]: Refreshing state... [id=Z0173878287JIU5M4KB8R__pop3s._tcp.mail-test.seagl.org_SRV]
module.production_env.aws_route53_record.mailu-test-autoconfig-srv["_submissions._tcp"]: Refreshing state... [id=Z0173878287JIU5M4KB8R__submissions._tcp.mail-test.seagl.org_SRV]
module.production_env.aws_route53_record.mailu-test-autoconfig-srv["_submission._tcp"]: Refreshing state... [id=Z0173878287JIU5M4KB8R__submission._tcp.mail-test.seagl.org_SRV]
module.production_env.aws_route53_record.mailu-test-autoconfig-srv["_imap._tcp"]: Refreshing state... [id=Z0173878287JIU5M4KB8R__imap._tcp.mail-test.seagl.org_SRV]
module.production_env.aws_route53_record.mailu-test-autoconfig-srv["_autodiscover._tcp"]: Refreshing state... [id=Z0173878287JIU5M4KB8R__autodiscover._tcp.mail-test.seagl.org_SRV]
module.production_env.aws_route53_record.mailu-test-autoconfig-srv["_imaps._tcp"]: Refreshing state... [id=Z0173878287JIU5M4KB8R__imaps._tcp.mail-test.seagl.org_SRV]
module.production_env.aws_route53_record.mailu-test-dkim: Refreshing state... [id=Z0173878287JIU5M4KB8R_dkim._domainkey.mail-test.seagl.org_TXT]
module.production_env.aws_route53_record.mailu-test-autoconfig-srv["_pop3._tcp"]: Refreshing state... [id=Z0173878287JIU5M4KB8R__pop3._tcp.mail-test.seagl.org_SRV]
module.production_env.aws_route53_record.mailu-test-dmarc: Refreshing state... [id=Z0173878287JIU5M4KB8R__dmarc.mail-test.seagl.org_TXT]
aws_route53_record.cloud-aaaa: Refreshing state... [id=Z0173878287JIU5M4KB8R_cloud.seagl.org_AAAA]
aws_route53_record.route_53_cloud_txt: Refreshing state... [id=Z0173878287JIU5M4KB8R_cloud.seagl.org_TXT]
aws_route53_record.email_dkim_hubspot_records["hs1-40081384"]: Refreshing state... [id=Z0173878287JIU5M4KB8R_hs1-40081384._domainkey.seagl.org_CNAME]
aws_route53_record.cloud-a: Refreshing state... [id=Z0173878287JIU5M4KB8R_cloud.seagl.org_A]
aws_route53_record.email_dkim_hubspot_records["hs2-40081384"]: Refreshing state... [id=Z0173878287JIU5M4KB8R_hs2-40081384._domainkey.seagl.org_CNAME]
module.production_env.aws_ses_domain_dkim.email_dkim: Refreshing state... [id=seagl.org]
module.prod_db.aws_secretsmanager_secret_version.osem-db-pass-val: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:663166083306:secret:db-pass-osem-5KW1mS|5E8ED816-E9AA-4E8E-A382-2EEE9FC74A66]
module.production_env.module.nc-office-vm.openstack_networking_secgroup_rule_v2.ipv6-egress: Refreshing state... [id=cb85269b-39fc-4169-8fd2-ba7e360b16e5]
module.production_env.module.nc-office-vm.openstack_compute_instance_v2.instance: Refreshing state... [id=321fae7f-cbe4-4237-a44e-49c748d82dba]
module.production_env.module.nc-office-vm.openstack_networking_secgroup_rule_v2.icmp4-ingress: Refreshing state... [id=2373bb0c-08d7-4d05-9101-8194e7a86b50]
module.production_env.module.nc-office-vm.openstack_networking_secgroup_rule_v2.ipv4-egress: Refreshing state... [id=b4c16127-ae56-48c8-aa65-ca37c49c9c79]
module.production_env.module.nc-office-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["22"]: Refreshing state... [id=b88334fc-505c-4849-824c-11f03eb59e75]
module.production_env.module.nc-office-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["443"]: Refreshing state... [id=f9de80b9-a92e-4629-96a6-4a896cbf9f9e]
module.production_env.module.nc-office-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["80"]: Refreshing state... [id=5b266c7d-c72b-4395-a8fe-43ed8df1aa6f]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.ipv4-egress: Refreshing state... [id=8fa82fbe-3b58-4f1d-beb3-a371cd7006a1]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.icmp4-ingress: Refreshing state... [id=536162a0-b5d8-40f4-a1e5-62327d031c34]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.ipv6-egress: Refreshing state... [id=bc3215ca-0357-4914-877c-93bd69071fb2]
module.production_env.module.mailu-vm.openstack_compute_instance_v2.instance: Refreshing state... [id=c388c80b-fa29-40fe-ae0b-e93803e87b22]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["80"]: Refreshing state... [id=4abb1ded-c162-4de8-b90d-6c40a9061c09]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["995"]: Refreshing state... [id=05bbe377-1579-4e54-a92f-88b6cca34449]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["110"]: Refreshing state... [id=ea335d3e-b5c9-4606-bd8d-238afafe2210]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["22"]: Refreshing state... [id=145b0c38-a81b-4d83-ac82-3cf680eced41]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["25"]: Refreshing state... [id=e44bcd67-f3e4-4399-a243-40f611c305ac]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["443"]: Refreshing state... [id=4122edd4-dc37-46dd-8f6e-2e4db2e79dc3]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["143"]: Refreshing state... [id=2643a76b-3fbd-44cc-aebf-58a1e982d69f]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["993"]: Refreshing state... [id=20cea76b-b319-474f-97ed-1f609c5c6e0d]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["465"]: Refreshing state... [id=87d006c0-aec4-4ae4-8999-b156e40950e4]
module.production_env.module.mailu-vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["587"]: Refreshing state... [id=60dca189-4b69-4838-b9b7-47e25f9822cd]
module.production_env.aws_route53_record.email_dkim_records[2]: Refreshing state... [id=Z0173878287JIU5M4KB8R_o7o3tsrrlwgkmmx3a7f5njkrvi75woso._domainkey.seagl.org_CNAME]
module.production_env.aws_route53_record.email_dkim_records[0]: Refreshing state... [id=Z0173878287JIU5M4KB8R_nldzqxeyq5fyslu3tzvj4ltbwbexupuj._domainkey.seagl.org_CNAME]
module.production_env.aws_route53_record.email_dkim_records[1]: Refreshing state... [id=Z0173878287JIU5M4KB8R_zjerfwsrr5wpwp5p5klnsrrzp6ralpcp._domainkey.seagl.org_CNAME]
data.aws_vpc.vpc: Read complete after 1s [id=vpc-231ecb46]
module.prod_db.aws_security_group.osem_rds_security_group: Refreshing state... [id=sg-006c493d98f3c7f1a]
module.prod_db.aws_security_group_rule.private_in: Refreshing state... [id=sgrule-3182957500]
module.prod_db.aws_security_group_rule.private_out: Refreshing state... [id=sgrule-1612436969]
module.prod_db.aws_db_instance.osem: Refreshing state... [id=osem]
module.production_env.module.nc-office-vm.aws_route53_record.dns-a: Refreshing state... [id=Z0173878287JIU5M4KB8R_nc-office.host.seagl.org_A]
module.production_env.module.mailu-vm.aws_route53_record.dns-a: Refreshing state... [id=Z0173878287JIU5M4KB8R_mailu.host.seagl.org_A]
aws_s3_bucket_public_access_block.state: Refreshing state... [id=seagl-terraform]
aws_s3_bucket_versioning.state: Refreshing state... [id=seagl-terraform]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.production_env.aws_ses_domain_dkim.email_dkim has been deleted
  - resource "aws_ses_domain_dkim" "email_dkim" {
      - dkim_tokens = [
          - "nldzqxeyq5fyslu3tzvj4ltbwbexupuj",
          - "zjerfwsrr5wpwp5p5klnsrrzp6ralpcp",
          - "o7o3tsrrlwgkmmx3a7f5njkrvi75woso",
        ] -> null
        id          = "seagl.org"
        # (1 unchanged attribute hidden)
    }

  # module.production_env.aws_ses_domain_identity.main has been deleted
  - resource "aws_ses_domain_identity" "main" {
      - domain             = "seagl.org" -> null
        id                 = "seagl.org"
        # (2 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.production_env.aws_route53_record.email_dkim_records[0] must be replaced
-/+ resource "aws_route53_record" "email_dkim_records" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "nldzqxeyq5fyslu3tzvj4ltbwbexupuj._domainkey.seagl.org" -> (known after apply)
      ~ id              = "Z0173878287JIU5M4KB8R_nldzqxeyq5fyslu3tzvj4ltbwbexupuj._domainkey.seagl.org_CNAME" -> (known after apply)
      ~ name            = "nldzqxeyq5fyslu3tzvj4ltbwbexupuj._domainkey.seagl.org" # forces replacement -> (known after apply) # forces replacement
      ~ records         = [
          - "nldzqxeyq5fyslu3tzvj4ltbwbexupuj.dkim.amazonses.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.production_env.aws_route53_record.email_dkim_records[1] must be replaced
-/+ resource "aws_route53_record" "email_dkim_records" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "zjerfwsrr5wpwp5p5klnsrrzp6ralpcp._domainkey.seagl.org" -> (known after apply)
      ~ id              = "Z0173878287JIU5M4KB8R_zjerfwsrr5wpwp5p5klnsrrzp6ralpcp._domainkey.seagl.org_CNAME" -> (known after apply)
      ~ name            = "zjerfwsrr5wpwp5p5klnsrrzp6ralpcp._domainkey.seagl.org" # forces replacement -> (known after apply) # forces replacement
      ~ records         = [
          - "zjerfwsrr5wpwp5p5klnsrrzp6ralpcp.dkim.amazonses.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.production_env.aws_route53_record.email_dkim_records[2] must be replaced
-/+ resource "aws_route53_record" "email_dkim_records" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "o7o3tsrrlwgkmmx3a7f5njkrvi75woso._domainkey.seagl.org" -> (known after apply)
      ~ id              = "Z0173878287JIU5M4KB8R_o7o3tsrrlwgkmmx3a7f5njkrvi75woso._domainkey.seagl.org_CNAME" -> (known after apply)
      ~ name            = "o7o3tsrrlwgkmmx3a7f5njkrvi75woso._domainkey.seagl.org" # forces replacement -> (known after apply) # forces replacement
      ~ records         = [
          - "o7o3tsrrlwgkmmx3a7f5njkrvi75woso.dkim.amazonses.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.production_env.aws_ses_domain_dkim.email_dkim will be created
  + resource "aws_ses_domain_dkim" "email_dkim" {
      + dkim_tokens = (known after apply)
      + domain      = "seagl.org"
      + id          = (known after apply)
    }

  # module.production_env.aws_ses_domain_identity.main will be created
  + resource "aws_ses_domain_identity" "main" {
      + arn                = (known after apply)
      + domain             = "seagl.org"
      + id                 = (known after apply)
      + verification_token = (known after apply)
    }

Plan: 5 to add, 0 to change, 3 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.state,
  on s3.tf line 1, in resource "aws_s3_bucket" "state":
   1: resource "aws_s3_bucket" "state" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @strugee, Action: `pull_request`*